{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "vgg16_input"}}, {"class_name": "Functional", "config": {"name": "vgg16", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["block5_pool", 0, 0]]}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of123.bin", "group1-shard2of123.bin", "group1-shard3of123.bin", "group1-shard4of123.bin", "group1-shard5of123.bin", "group1-shard6of123.bin", "group1-shard7of123.bin", "group1-shard8of123.bin", "group1-shard9of123.bin", "group1-shard10of123.bin", "group1-shard11of123.bin", "group1-shard12of123.bin", "group1-shard13of123.bin", "group1-shard14of123.bin", "group1-shard15of123.bin", "group1-shard16of123.bin", "group1-shard17of123.bin", "group1-shard18of123.bin", "group1-shard19of123.bin", "group1-shard20of123.bin", "group1-shard21of123.bin", "group1-shard22of123.bin", "group1-shard23of123.bin", "group1-shard24of123.bin", "group1-shard25of123.bin", "group1-shard26of123.bin", "group1-shard27of123.bin", "group1-shard28of123.bin", "group1-shard29of123.bin", "group1-shard30of123.bin", "group1-shard31of123.bin", "group1-shard32of123.bin", "group1-shard33of123.bin", "group1-shard34of123.bin", "group1-shard35of123.bin", "group1-shard36of123.bin", "group1-shard37of123.bin", "group1-shard38of123.bin", "group1-shard39of123.bin", "group1-shard40of123.bin", "group1-shard41of123.bin", "group1-shard42of123.bin", "group1-shard43of123.bin", "group1-shard44of123.bin", "group1-shard45of123.bin", "group1-shard46of123.bin", "group1-shard47of123.bin", "group1-shard48of123.bin", "group1-shard49of123.bin", "group1-shard50of123.bin", "group1-shard51of123.bin", "group1-shard52of123.bin", "group1-shard53of123.bin", "group1-shard54of123.bin", "group1-shard55of123.bin", "group1-shard56of123.bin", "group1-shard57of123.bin", "group1-shard58of123.bin", "group1-shard59of123.bin", "group1-shard60of123.bin", "group1-shard61of123.bin", "group1-shard62of123.bin", "group1-shard63of123.bin", "group1-shard64of123.bin", "group1-shard65of123.bin", "group1-shard66of123.bin", "group1-shard67of123.bin", "group1-shard68of123.bin", "group1-shard69of123.bin", "group1-shard70of123.bin", "group1-shard71of123.bin", "group1-shard72of123.bin", "group1-shard73of123.bin", "group1-shard74of123.bin", "group1-shard75of123.bin", "group1-shard76of123.bin", "group1-shard77of123.bin", "group1-shard78of123.bin", "group1-shard79of123.bin", "group1-shard80of123.bin", "group1-shard81of123.bin", "group1-shard82of123.bin", "group1-shard83of123.bin", "group1-shard84of123.bin", "group1-shard85of123.bin", "group1-shard86of123.bin", "group1-shard87of123.bin", "group1-shard88of123.bin", "group1-shard89of123.bin", "group1-shard90of123.bin", "group1-shard91of123.bin", "group1-shard92of123.bin", "group1-shard93of123.bin", "group1-shard94of123.bin", "group1-shard95of123.bin", "group1-shard96of123.bin", "group1-shard97of123.bin", "group1-shard98of123.bin", "group1-shard99of123.bin", "group1-shard100of123.bin", "group1-shard101of123.bin", "group1-shard102of123.bin", "group1-shard103of123.bin", "group1-shard104of123.bin", "group1-shard105of123.bin", "group1-shard106of123.bin", "group1-shard107of123.bin", "group1-shard108of123.bin", "group1-shard109of123.bin", "group1-shard110of123.bin", "group1-shard111of123.bin", "group1-shard112of123.bin", "group1-shard113of123.bin", "group1-shard114of123.bin", "group1-shard115of123.bin", "group1-shard116of123.bin", "group1-shard117of123.bin", "group1-shard118of123.bin", "group1-shard119of123.bin", "group1-shard120of123.bin", "group1-shard121of123.bin", "group1-shard122of123.bin", "group1-shard123of123.bin"], "weights": [{"name": "dense_14/kernel", "shape": [25088, 4096], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [4096, 2048], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [2048], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [2048, 1024], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_17/kernel", "shape": [1024, 4], "dtype": "float32"}, {"name": "dense_17/bias", "shape": [4], "dtype": "float32"}, {"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}]}]}